  <para> Com el uso de AMIDE es completamente intuitivo s&oacute;lo para el
  escribi&oacute; el programa (es decir yo), este secci&oacute;n proporci&oacute;na una
  breve panor&aacute;mica de del uso del programa. se asume que tiene
  estudios cargados. Para ver lasinstruciones para cargar estudios en
  el AMIDE referirse a <xref linkend="importing_data_sets" />.</para>
  
  <sect2><title>Teor&iacute;a R&aacute;pida de Operaciones</title>

   <sect3><title>Objetos AMIDE</title>

    <para>AMIDE pude trabajar y visualizar multiplicidad de objetos
    simult&aacute;neamente (limitado s&oacute;lo por la RAM disponible). Los tipos
    de objetos actualmente implementados en AMIDE son los siguientes:

    <variablelist>
 
      <varlistentry><term>Volumen de Datos</term>
      <listitem>
       <para>Un volumen de datos contiene la informaci&oacute;n cruda de un
       estudio de imagen m&eacute;dica, junto con los par&aacute;metros necesarios
       para su correcta interpretaci&oacute;n con esa informaci&oacute;n (umbrales,
       mapas de color, etc.).
       </para>
      </listitem>
      </varlistentry>

      <varlistentry><term>ROI</term>
      <listitem>
       <para>Regi&oacute;n de Inter&eacute;s(Region Of Interest,ROI), este objeto
       define un subvolumen del volumen de datos sobre el cual pueden
       calcularse estad&iacute;sticas. Todos los ROI's en AMIDE son
       volum&eacute;tricos. Actualmente, AMIDE implementa las siguieintes
       geometr&iacute;as en los ROI: elipsoide, cil&iacute;drico, rectangular, and
       isocontornos.
       </para>
      </listitem>
      </varlistentry>

      <varlistentry><term>Marcador Fiducial</term>
      <listitem>
       <para>Es un objeto muy simple , los Marcadores Fiduciales s&oacute;lo
        tiene la informaci&oacute;n sobre la referencia a un punto del
        espacio, y son usadas para el al&iacute;neamiento de cuerpos rigidos.
       </para>
      </listitem>
      </varlistentry>

      <varlistentry><term>Estudio</term>
      <listitem>
       <para>Cada sesi&oacute;n de AMIDE tiene un simple objeto de estudio,
       que se usa para agrupar un n&uacute;mero de vol&uacute;menes de datos, ROI's,
       y marcas fiduciales. 
       </para>
      </listitem>
      </varlistentry>

     </variablelist>


    </para>
   </sect3>

   <sect3><title>Objeto Arbol</title> 


   <figure id="studytree-fig">
    <title>Arbol de Estudio</title>
    <screenshot>
     <mediaobject>
      <imageobject>
       <imagedata fileref="figures/study_tree.png" format="PNG"/>
      </imageobject>
      <textobject>
       <phrase>Un ejemplo de &aacute;rbol de estudio en AMIDE. Los dos
       vol&uacute;menes de datos (FDG PET y microCT) y 1 ROI (vegiga) son
       hijos del objeto estudio (m2862). Los ROI's restantes son hijos
       del volumen de datos.</phrase>
      </textobject>
     </mediaobject>
    </screenshot>
   </figure>



    <para> Para facilitar el trabajo con un gran n&uacute;mero de objetos
    simult&aacute;neamente, AMIDE conceptualmente agrupa todos objetos en una
    jerarqu&iacute;a de &aacute;rbol, con el object estudio como raiz del &aacute;rbol (ver
    <xref linkend="studytree-fig" />). Los objetos de vol&uacute;menes de
    datos ser&aacute;n ramas principales del objeto estudio, mientras que los
    ROI's pueden ser ramas del objeto estudio o de los objetos de
    vol&uacute;menes de datos. Por qu&eacute; es esto importante. Porque la
    estructura del &aacute;rbol determina como los movimientos son seguidos
    por el programa. Si un volumen de datos es movido con respecto al
    resto del estudio, los ROI's que son ramas de ese volumen de datos
    son movidos acordemente con aquel, as&iacute; se mantendr&aacute; la correcta
    orientaci&oacute;n y posi&oacute;n con respecto al volumen de datos
    padre.</para>
   </sect3>

   <sect3><title>Unidades del mundo real</title>

    <para>Es importante darse cuenta trabajando con AMIDE que el
    programa intentar&aacute; abstraer el formato de sobreimpresi&oacute;n digital
    tanto como sea posible. Cuando eschucha un CD de audio, el
    reproductor convierte autom&aacute;ticamente una serie de ceros y unos
    codificdos en el disco en formato digital, y as&iacute; usted no tiene
    que preocuparse del formato digital subyaccente. De manera
    similar, AMIDE presenta los datos digitales de forma
    anal&oacute;gica. Siempre que sea posible las unidades empleadas son
    unidades del mundo real (mm, seg..), y al mayor&iacute;a de operaciones
    no estan limitadas por la la naturaleza discreta de los datos
    subyaccentes. Por ejemplo, los datos son vistos en t&eacute;rmino de
    "cortes" y no de planos fijos de im&aacute;genes. Estos cortes pueden
    extraerse del volumen de datos en cualquier &aacute;ngulo, y con
    cualquier grosor (no s&oacute;lo limitado a m&uacute;ltiplos del tama&ntilde;o del
    voxel). Usted pude estar acostumbrado a mirar las im&aacute;genes m&eacute;dicas
    en t&eacute;rminos de de v&oacute;xeles y de enteros, pero recuerde que el
    sujeto escaneado es parte del mundo real, y AMIDE intentar&aacute;
    recrear esta "se&ntilde;al anal&oacute;gica" para usted.</para>

    <para> El &uacute;nico sitio donde la abstracci&oacute; empieza a romperse y
    cuando se trabaja con vol&uacute;menes de datos din&aacute;micos. Einstein
    entendi&oacute; que el tiempo es una "dimensi&oacute;n" especial, y AMIDE est&aacute;
    de acuerdo. La raz&oacute;n de esto es que intentando representar datos
    din&aacute;micos pero en segmentos de tiempo separados resulta complejo
    desde el punto de vista computacional, primeramente por que los
    datos din&aacute;nicos no suelen estar igualmente espaciados. Mientras
    que moverse en el espacio 1 voxel en las direciones x, y o z
    siempre equivale a una unidad constante de medida (por ejemplo 0.4
    mm) en la direcci&oacute;n apropiada, mover un voxel en la direcci&oacute;n t
    puede ser de 30 segundos o de 30 minutos, dependiendo que segmento
    de tiempo este mirando. Por esto, AMIDE trabaja con el tiempo en
    t&eacute;rminos de segmentos (frames), aunque AMIDE siempre nos dir&aacute; el
    tiempo al que corresponede cada segmento.</para>

   </sect3>


  </sect2>









  <sect2><title>Componentes del Display</title>

   <figure id="mainwindow-fig">
    <title>Ventana Principal de AMIDE</title>
    <screenshot>
     <mediaobject>
      <imageobject>
       <imagedata fileref="figures/amide_main_window.png" format="PNG"/>
      </imageobject>
      <textobject>
       <phrase>Diagrama se&ntilde;alando lo m&aacute;s destacable de la ventana principal</phrase>
      </textobject>
     </mediaobject>
    </screenshot>
   </figure>


   <sect3><title>Ayuda Sensible al Contexto</title>

      <para>Localizada en la esquina inferior izquierda de la ventana,
      la ayuda sensible al contexto mostrar&aacute; que lo que suceder&aacute; al
      apretar los diferentes botones del rat&oacute;n o las combinaciones de
      teclas. Los botones estan marcados a la manera UNIX,
      correspondiendo el 1, 2 y 3 a izquierdo, medio y derecho
      respectivamente. En los ratones con s&oacute;lo dos botones, el del
      medio es emulado apretando los dos botones a la vez.</para>

   </sect3>



   <sect3><title>Vista del Arbol de Datos del Estudio</title>

    <para>Localizado en la parte izquierda de la ventana esta una
    &aacute;rbol que lista todos los objetos del estudio. La estructura de
    &aacute;rbol muestra como los movimientos ser&aacute;n propagados a los objetos
    del estudio. Por ejemplo si un volumen de datos es rotado, todos
    sus objetos hijos ser&aacute;n rotados acordemente.</para>

    <para>Objetos del &aacute;rbol pueden ser selecionados con pulsaci&oacute;n en
    el bot&oacute;n 1, en el nombre del objeto. Click en el 2 "activa" el
    objeto. El "volumen activo de datos" aparecer&aacute; remarcado, y cuando
    se una selecciona una funci&oacute;n (por ejemplo un filtro), esta ser&aacute;
    aplicada s&oacute;lo al "volumen activo de datos".</para>

    <para> Al di&aacute;logo de modificaci&oacute;n de objetos se pude acceder con
    el bot&oacute;n 3, haciendo pulsaci&oacute;n sobre el objeto,
    correspondiente. Los ROI's se pueden a&ntilde;adir haciendo pulsaci&oacute;n con
    el bot&oacute;n 1 en un &aacute;rea desnuda del &aacute;rbol, o con MAYUSCULAS+bot&oacute;n 3
    en un objeto. . Estas funci&oacute;nes se describen con mayor detalle en
    <xref linkend="data_sets" /> and <xref linkend="rois" />.</para>
   </sect3>
    

   <sect3><title>Vistas Ortogonales</title>
    
    <para> La mayor&iacute;a de la ventana principal corresponde a vistas
    ortogonales del los vol&uacute;menes de datos a visualizar. Los datos
    usualmente se presentan como tres vistas ortogonales, pero el
    usuario pude decidir usar menos, usando le selector de vistas
    (descrito abajo en <xref linkend="view_selector" />). Las tres
    vistas mostradas son los planos axial , coronal, and
    sagital. N&oacute;tese que las vistas pueden aparecer incorrectamente
    marcadas. esto puede ocurrir si si el fichero importado no esta en
    el orden que AMIDE espera. Podr&iacute;a ser por que usa una terminolog&iacute;a
    diferente de orientaci&oacute;n al la del programa (por ejemplo la
    secci&oacute;n coronal del cerebro de una rata no es la misma orientaci&oacute;n
    coronal de la rata).</para>


    <para> Bajo las vistas hay barras desplazables para cambiar el
    lugar de donde las vistas son tomadas. La localizaci&oacute;n tambi&eacute;n
    puede cambiarse haciendo pulsaci&oacute;n directamente sobre imagen de la
    vista.  Las pulsaci&oacute;ns de rat&oacute;n apropiadas son:</para>


   <variablelist> 

    <varlistentry><term>Boton 1 del rat&oacute;n</term>
     <listitem>
      <para>Cambia localizaci&oacute;n de los cortes sin cambiar su grosor.</para>
    </listitem>
    </varlistentry>

    <varlistentry><term>Boton 2 del rat&oacute;n</term>
    <listitem>
     <para>Cambia la localizaci&oacute;n de los cortes, poniendo el grosor de
     los cortes a un m&iacute;nimo raz&oacute;nable. </para>
    </listitem>
    </varlistentry>

    <varlistentry><term>Boton 3 del rat&oacute;n</term>
    <listitem>
     <para>
       Haciendo pulsaci&oacute;n y arrastrando sin soltar cambia el grosor de
       los cortes sin cambiar su localizaci&oacute;n. El grosor de los cortes
       tambi&eacute;n puede alterarse con el bot&oacute;n rotatorio de ajuste de
       grosor de corte (ver <xref linkend="slice_thickness_setting"
       />).</para>
    </listitem>
    </varlistentry>

  
    <varlistentry><term>Otras</term>
    <listitem>
     <para>Funcionalidades Adicionales de los botones del rat&oacute;n se
     explican en <xref linkend="data_sets" /> y <xref linkend="rois"
     />.</para>
    </listitem>
    </varlistentry>

   </variablelist>

   </sect3>

   
   <sect3 id="view_selector"><title>Selector de Vistas</title>
    
    <para>Cual de las tres vistas ortogonales se puden selecionar
    usndo esos botones. Por defecto las tres son mostradas.</para>

   </sect3>


   <sect3><title>Visi&oacute;n Sincronizada</title>
    
    <para>Adem&aacute;s de esas tres vistas, AMIDE pude mostrar m&uacute;ltiples
    conjuntos de vistas ortogonales, todos mirando al mismo punto
    ("sincronizado") del espacio 3D. Esto se usa m&aacute;s a menudo para ver
    la fusi&oacute;n de dos vol&uacute;menes de datos, con un grupo de vistas del
    primer volumen, y el siguiente usado para el segundo, y el tercero
    para la fusi&oacute;n de los dos vol&uacute;menes.</para>

   </sect3>


   <sect3 id="threshold_dialog"><title>Herramienta de Cambio de Umbral</title>
    
    <para> Este bot&oacute;n en la barra de herramientas lanza el selector de
    mapas de color del volumen de datos activo. En el di&aacute;logo, los
    niveles m&aacute;ximos y m&iacute;nimos de umbral pueden cambiarse directamente
    escribiendo los valores (en unidades absolutas o porcentage) , o
    usando las barras de desplazamiento en la brara de color. La
    escala de color se puede cambiar usando el correspondiente men&uacute;
    desplegable. Un histograma normalizado da una idea de la
    distribuci&oacute;n de los valores del volumen de datos. Finalmente el
    tipo de umbral se puede cambiar. El tipo de umbral determina como
    los valores de umbral m&iacute;nimos y m&aacute;ximos se aplican al conjunto de
    datos, y son:
    </para>

	<variablelist> 

		<varlistentry><term>Por Corte</term>
		<listitem><para>Los valores m&iacute;nimos y m&aacute;ximos se
		aplicar&aacute;n en proporci&oacute;n al corte
		selecionado. </para></listitem>
		</varlistentry>

		<varlistentry><term>Por Marco</term>
		<listitem><para>Los valores m&iacute;nimos y m&aacute;ximos se
		aplicar&aacute;n en proporci&oacute;n al segmento de tiempo
		selecionado. </para></listitem>
		</varlistentry>

		<varlistentry><term>Interpolaci&oacute;n entre Segmentos de
		Tiempo</term> <listitem><para>Este umbral s&oacute;lo tiene
		sentido para estudios din&aacute;micos. En este modo dos
		pares de valores m&aacute;ximos y m&iacute;nimos son selecionados
		para cada segmento de tiempo. Para cada segmento
		anterior e incluyendo el primer segmento seleccionado
		se usa el primer par de valores. Para el segmento
		segundo y subsiguientes se aplica el segundo par de
		valores. Para los segmentos incluidos entre el primer
		y segundo segmentos seleccionados los valores m&aacute;ximos
		y m&iacute;nimos son interpolados como funci&oacute;n del tiempo
		entre los dos pares de valores
		establecidos. </para></listitem>
		</varlistentry>

		<varlistentry><term>Global</term> <listitem><para>Los
		valores m&iacute;nimo y m&aacute;ximos ser&aacute;n aplicados en proporci&oacute;n
		al los valores m&iacute;nimos y m&aacute;ximos del conjunto total de
		datos. </para></listitem>
		</varlistentry>

	</variablelist>

   </sect3>



   <sect3><title>Selector de Zoom</title>
    
    <para>Este especifica cuanto se magnificar&aacute;n las vistas. AMIDE
    intenta hacer una educada adivinanza de cuan grande han de ser las
    im&aacute;genes usando la dimensi&oacute;n m&aacute;s peque&ntilde;a con los v&oacute;xeles m&aacute;s
    grandes correspondiendo al pixel representado. El zoom se pude
    utilizar en adicci&oacute; a esto.</para>

   </sect3>



   <sect3 id="slice_thickness_setting"><title>Ajuste del Grosor de Corte</title>
    
    <para> El grosor especifica c&oacute;mo de profundas han de ser la vistas
    representadas. El grosor de corte m&iacute;nimo viene determinado por la
    dimensi&oacute;n del voxel m&aacute;s peque&ntilde;o del conjunto de datos.
    </para>

   </sect3>



   <sect3 id="frame-dialog"><title>Selector de Segmentos de Tiempo(Frames)</title>
    
    <para>Este bot&oacute;n abre un di&aacute;logo para seleccionar el segmento a
    mostrar de un conjunto de datos din&aacute;micos. Un segmento
    (p.e. periodo de tiempo) para mostrar puede ser seleccionado
    haciendo pulsaci&oacute;n en una lista de elementos. M&uacute;ltiples segmentos
    puden ser seleccionados a la vez con pulsaci&oacute;n y simult&aacute;neamente
    apretando la tecla MAYUSC para seleccionar segmentos
    adicionales. N&oacute;tese que por cada conjunto de datos seleccionados
    al menos un segmento ser&aacute; visulaizado. Si elige un periodo de
    tiempo que no incluye un segmento de tiempo de ese conjunto de
    datos, el segmento m&aacute;s aproximado ser&aacute; elegido.</para>

   </sect3>


   <sect3><title>Selector de Puntero(Target)</title>
    
    <para>El puntero en forma de cruz generalmente s&oacute;lo resulta
    visible cuando apretamos un bot&oacute;n del rat&oacute;n. Con este bot&oacute;n la
    cruz permanece siempre visible.</para>

   </sect3>


   <sect3 id="interpolation"><title>Interpolaci&oacute;n</title>
    
    <para>Interpolaci&oacute;n se refiere al m&eacute;todo con el que AMIDE extrae
    datos del conjunto de datos de imagen m&eacute;dica original para ser
    representados en pantalla. El bot&oacute;n que seleciona la interpolaci&oacute;n
    permite al usuario especificar que tipo de interpolaci&oacute;n usar para
    generar cortes del volumen activo de datos. "Nearest neighbor" es
    el m&aacute;s r&aacute;pido, pero tri-l&iacute;near produce im&aacute;genes de mejor aspecto,
    con la penalizaci&oacute;n de que es casi 8 veces m&aacute;s lento.
    </para>

   </sect3>


   <sect3><title>Selector Fusi&oacute;n/Sobreimpresi&oacute;n</title>
    
    <para>Por defecto AMIDE muestra m&uacute;ltiples vol&uacute;mens de datos como
    im&aacute;genes fusionadas. Con el selector
    fusi&oacute;n/sobrimpresi&oacute;n(fused/overlay) usted elige si quiere mejor
    los vol&uacute;menes sobreimpresi&oacute;nados mejor que fusionados.</para>

   </sect3>

  <sect3 id="preferences-dialog"><title>Di&aacute;logo de Preferences</title>
    <para>
      Debajo del men&uacute; de Edici&oacute;n esta el de preferencias. Este
      desplegar&aacute; un men&uacute; de como las cosas deben de ser mostradas por
      AMIDE. Las preferencias se guardaran in un fichero de
      configuraci&oacute;n para su futuro uso en AMIDE.  </para>

    <variablelist>

    <varlistentry><term>Preferencias de Dibujo de ROI</term>
     <listitem><para> El grosor de la l&iacute;nea para dibujar ROIs pude ser
     cambiado aqu&iacute;. El grosor oscila entre 1 y 5
     pixel. </para></listitem>
    </varlistentry>

    <varlistentry><term>Preferences de la Disposi&oacute;n de las Vistas</term> 
    <listitem><para> La primera opci&oacute;n le permite usar
     tres vistas (axial, coronal y sagital) con un estilo lineal
     usualmente usado por los software de PET, y un estilo ortogonal
     usado por el software de RNM. La segunda opci&oacute;n le permite fijar
     si el tama&ntilde;o de la vista ha de permenecer constante o no. Si no
     esta activada, el tama&ntilde;o de las vistas mostradas depender&aacute; s&oacute;lo
     de los vol&uacute;menes seleccionados. Si esta activada, el tama&ntilde;o del
     las vistas depender&aacute; de todos vol&uacute;menes del estudio. La opci&oacute;n
     final es para ajustar el tama&ntilde;o del &aacute;rea vac&iacute;a en medio del
     puntero (la cruz mostrada cunado se cambia la localizaci&oacute;n de la
     vista) </para></listitem>
    </varlistentry>

    <varlistentry><term>Preferencias de las Tablas de Color</term>
      <listitem> <para> El programa usa por defecto la Tabla de Color
      del conjunto de datos m&aacute;s recientemente importado.
      </para></listitem>
    </varlistentry>
    
    <varlistentry><term>Misc. Preferencias.</term>
      <listitem> 

       <para> Con la opci&oacute;n "Don't prompt for 'save changes' on exit"
       No notificaci&oacute;n para guardar los cambios al salir, evitar&aacute; que
       AMIDE le notifique al salir del programa si quiere gurdar los
       cambios.</para>

       <para> La opci&oacute;n segunda 'save .XIF file as directory' (Guarde
       fichero .XIF como directorio) permite que el fichero de AMIDE
       XIF se guarde como una estructura de directorio y no como un
       fichero plano (por defecto). Esta opci&oacute;n intersa sobre todo a
       los desarrolladores.
       </para>

     </listitem>
    </varlistentry>

    </variablelist>

  </sect3>


</sect2>
