<para> El Renderizado en AMIDE se lleva a cabo usando la librer&iacute;a de
  renderizado de volumenes<ulink type="http"
  url="http://graphics.stanford.edu/software/volpack/">
  Volpack</ulink>. Esta librer&iacute;a de software es portable y , permite
  renderizado verdadero del volumen (en oposici&oacute;n al renderiazado de
  superficie usado por otras librer&iacute;as de software para aceleradoras
  de hardware).
</para>

<para> Para comenzar la ventana de Renderizado, seleccionar los
  volumenes y ROI's que deseara incluir en el rederizado, y pulse el
  item del men&uacute;g "View->Rendering" . Se desplegar&aacute; una peque&ntilde;a ventana
  de di&aacute;logo con dos opci&oacute;nes. La primera "Set values greater than max
  threshold to zero(Poner los valores mayores que max a cero)" permite
  excluir del proceso los valores m&aacute;ximos. En general no desear&aacute; esto,
  pero prodr&iacute;a ser &uacute;til cuando hay valores muy altos que obscurecen
  zonas que quisiera ver. La segunda opci&oacute;n "Accelerate
  Rendering(Acelerear Renderizado)" hace que VolPack use un m&eacute;todo de
  aceleraci&oacute;n del proceso de renderizado. Obtendr&aacute; un aumento de
  velocidad (sobre 10 veces). Sin embargo requiere aproximadamente
  tres veces mas de memoria RAM, as&iacute; si dispone de poca RAM no use
  esta opci&oacute;n.
</para>

<para> Despues de pulsar "Execute" el programa convertir&aacute; los
  vol&uacute;menes y ROI's, al formato utilizado por Volpack y har&aacute; los
  c&aacute;lculos iniciales de renderizado. Para los vol&uacute;menes se utilizar&aacute;
  el <link linkend="interpolation">tipo de interpolaci&oacute;n</link>
  especificado. Este procedimiento tarda algo de tiempo , luego sea
  paciente. Por favor note tambien,que al convertir los vol&aacute;menes, los
  datos se escalan entre los l&iacute;mites m&iacute;nimo y m&aacute;ximos establecidos,
  luego todos los datos mayores del valor m&aacute;ximo se igualaran al valor
  m&aacute;ximo y todos los valores por debajo del m&iacute;nimo se igualaran al
  m&iacute;nimo. Este escalado pude ser relativo al m&iacute;nimo y m&aacute;ximo "Global",
  al m&iacute;nimo y m&aacute;ximo "Por Segmento de Tiempo(Frame)" , o al m&iacute;nimo y
  m&aacute;ximo "Interpolado Entre Segmentos". El escalado "por Corte" carece
  de sentido en el contexto de rederizado volum&eacute;trico, y sera
  interpretado como escaldo "Global".
</para>

<para> Cuando se finaliza esto se despliega una ventana. Su uso se
describe abajo.</para>



<sect2><title>Ventana de Renderizado</title>

  <sect3><title>Panel Principal de Renderizado</title>
    <para>
     El resultado del renderizado se representa en el centro de la
     ventana . Esta ventana permite la interacci&oacute;n con el usuario. El
     bot&oacute;n 1 permite rotar en el eje xy , y el bot&oacute;n 2 permite rotar
     en el eje z.
    </para>
  </sect3>


  <sect3><title>Barras de Giro</title>
    <para>
     Existe dos barra de desplazamiento, una encima de la imagen
     renderizada, y otra en el lado derecho. Estas estan marcadas
     apropiadamente con el eje sobre el cual rota el
     volumen. Adicionalmente existe una rudecilla marcada con la
     'z'. esta ruedecilla es para rotar sobre el eje z, que es el
     perpendicular a la imagen. N&oacute;tese que los efectos de rotaci&oacute;n son
     acumulativos.
    </para>
  </sect3>

  <sect3><title>Reset Axis</title>
    <para>
      Este bot&oacute;n situar&aacute; el volumen en su posici&oacute;n original.
    </para>
  </sect3>


  <sect3><title>Barra de Herramientas</title>

    <sect4 id="transfer-function-dialog"><title>Bot&oacute;n de Funci&oacute;n de Transferencia</title>

    <para> Este desplegar&aacute; un di&aacute;logo con las opci&oacute;nes abajo descritas:
    </para>

    <variablelist>

    <varlistentry><term>Tipo Retornado</term> 
      <listitem><para>Este determina si el renderizado sera mas
        an&aacute;logo a una radiograf&iacute;a (the "opacity" setting), o mas
        pareciado a una superficie (the "grayscale" setting). El
        "grayscale" hace esto especificando la iluminaci&oacute;n, el
        material y usa indicaci&oacute;n de profundidad.  </para></listitem>
    </varlistentry>

    <varlistentry><term>Tabla de Color</term>
      <listitem><para>
       Aqu&iacute; se puede cambiar la tabla de color de cada volumen renderizado. 
      </para></listitem>
    </varlistentry>

    
    <varlistentry><term>Funciones de Clasificaci&oacute;n</term>
      <listitem>
      <para>
        Esta el la parte m&aacute;s confusa del renderizado. Las funci&oacute;nes de
        clasificaci&oacute;n se usan para la correspondencia entre el valor
        de cada voxel y su representaci&oacute;n final en el renderizado. El
        el eje x son posibles valores de diferentes v&oacute;xeles. En ele
        eje y es la opacidad lo que otorgara el valor en funci&oacute;n del
        valor del voxel.
      </para>
      <para>
       Las funci&oacute;nes de clasificaci&oacute;n tiene varios bot&oacute;nes a la
       derecha de sus gr&aacute;ficas. El bot&oacute;n de arriba permite dibujar la
       funci&oacute;n como segmentos curvos. El segundo permite dibujar la
       funci&oacute;n como varias segmentos rectos. Finalmente el &uacute;ltimo
       dibuja de nuevo la linea recta inicial.
      </para>
      <para>
       Hay dos funci&oacute;nes de clasificaci&oacute;n:
      </para>

          <itemizedlist>

	  <listitem><para><emphasis>Dependientes de la
            Densidad:</emphasis> Esta funci&oacute;n dice cuan opaca es en
            fuci&oacute;n del valor del voxel. De alguna manera , tiene
            analog&iacute;a con los rayos X , donde la cantidad de rayos X
            absorbidos depende de la densidad de la
            estructura.</para></listitem>

	  <listitem><para><emphasis>Dependiente del Gradiente:
            </emphasis> En vez de relacionar la opacidad con la
            estructura, esta funci&oacute;n depende la opacidad del gradiente
            entre v&oacute;xeles (es decir cuanto cambia el valor de un voxel
            con respectoa sus vecinos). Este tiene un efecto de
            realzar las superficies. </para></listitem>

       </itemizedlist>
     </listitem>

     </varlistentry>
    </variablelist>
   </sect4>

    
   <sect4><title>Bot&oacute;n Monosc&oacute;pico/Estereosc&oacute;pico</title>
    <para> Puede elegir entre renderizar una imagen &uacute;nica
      (monosc&oacute;pica), o un par de im&aacute;genes esterosc&oacute;picas. Un par
      esterosc&oacute;pico de im&aacute;genes es cuando se generar a un &aacute;ngulo
      ligeramente diferente la una de la otra. Cuando se las mira de
      manera adecuada pueden ser percibidas por el observador como una
      imagen &uacute;nica tridimensional.
     </para>
   </sect4>

   <sect4><title>Zoom</title>
    <para> Determina el tama&ntilde;o de la imagen resultante
    renderizada. N&oacute;tese que el cambio de zoom no afecta a la velocidad
    de renderizado, e incrementando por encima de factor 1 de zoom
    tampoco se incrementara la resoluci&oacute;n de imagen
    renderizada.</para>
   </sect4>

  </sect3>




  <sect3><title>Rendering Menus</title>
    <sect4><title>File->Export Rendering</title>
      <para>
        Este men&uacute; le permite exportar la imagen renderizada a un fichero con formato jpg.
       </para>
    </sect4>

    <sect4><title>File->Create Movie</title>
      <para>
        Este causa el desplige de la ventana de generaci&oacute;n de
	video. Este di&aacute;logo se describe en mayor detalle abajo: <xref
	linkend="rendering-movie-dialog" />.
      </para>
    </sect4>
  
    <sect4><title>Edit->Rendering Parameters</title>
      <para>
       Este despliega el di&aacute;logo del par&aacute;metros del renderizado. Este
       dialogo se describe abajo en: <xref linkend="rendering-dialog"
       />.
      </para>
    </sect4>
  </sect3>
  
</sect2>

<sect2 id="rendering-dialog"><title>Di&aacute;logo de los Par&aacute;meters de Renderizado</title>

  <sect3><title>Velocidad vs. Calidad</title> 
   <para> Con este men&uacute;g desplegable el usuario puede elegir la
     velocidad y calidad del renderizado. Para incrementar la
     velocidad, los v&oacute;xeles cuyos valores sean el m&aacute;ximo y el m&iacute;nimo,
     seran tratados como totalmente opacos o transl&uacute;cidos
     respectivamente. La mayor calidad en cambio no usa esta
     aproximaci&oacute;n, la menor calidad si.</para>
  </sect3>


  <sect3><title>Par&aacute;metros Estereosc&oacute;picos</title>

   <para>Estos par&aacute;metros son usados para controlar el resultado
   cuando se ha elegido la opci&oacute;n "estereosc&oacute;pica".</para>
      
   <sect4><title>Stereo Angle</title> <para> 
     este es el angulo (en grados) entre el par de im&aacute;genes
     renderizadas. Increment&aacute;ndolo dara mas sensaci&oacute;n de
     profundidad. Un valor razonable para este par&aacute;metro es de 2 a 5
     grados. Este valor se puede guardar entre diferentes sesiones.
     </para>
   </sect4>
      
   <sect4><title>Eye Width (mm) </title>
    <para> 
      Idealmente corresponder&iacute;a a la distancia entre los ojos del
      observador. Aunque este par&aacute;metro est&aacute; especificado en
      mili&iacute;metros, la distancia real entre las dos im&aacute;genes depende de
      el ajuste de pantalla de cada ordenador. Si la informaci&oacute;n del
      monitor que tiene el sitema ioperativo (que normalmente es el
      caso), the "eye width" el par&aacute;metro no estara realmente en
      mil&iacute;metros. este par&aacute;metro pude ser guardado entre sesiones.
    </para>
  </sect4>

 </sect3>

 <sect3><title>Indicaci&oacute;n de Profundidad(Depth Cueing)</title>

  <para> Este par&aacute;metro s&oacute;lo se usa cuando los resultados son "en
  escala de grises".</para>
      
  <sect4><title>Permitir/Anular Depth Cueing</title>
   <para> Especifica si queremos o no 'Depth cueing'. Depth cueing
   pone una "niebla" que ocasiona que los v&oacute;xeles mas distantes
   aparezcan menos brillantes.</para>
  </sect4>
      
  <sect4><title>Factor Frontal(Front Factor)</title>
   <para> Es la transparencia de la niebla que se halla por delante
   del volumen. Si es un n&uacute;mero mayor que 1.0, los v&oacute;xeles de delante
   del volumen apareceran mas brillantes. Si fuera menor que 1.0, los
   v&oacute;xeles de delante del volumen apareceran mas obscuros.</para>
  </sect4>

  <sect4><title>Densidad</title>
   <para> Es cuan gruesa el la "niebla" . A mayor grosor de niebla los
   v&oacute;xeles aparecen m&aacute;s obscuros.</para>
  </sect4>
 </sect3>
</sect2>
    

<sect2 id="rendering-movie-dialog"><title>Di&aacute;logo de Animaci&oacute;n del Renderizado</title>

 <sect3><title>Frames</title>
      <para>
        Cuantas im&aacute;genes deber&iacute;a haber en el video MPEG1 . Los MPEG1 se
	generan a 30 im&aacute;genes/segundo, as&iacute; el valor por defecto, 300
	im&aacute;genes dar&aacute; un video de 10 segundos de duraci&oacute;n.
      </para>

 </sect3>

 <sect3><title>Rotatciones en [x,y,z]</title> 
      <para> Esto determina cuantas vueltas sobre un eje dado
       ocurrir&aacute;n a lo largo del video. La rotaci&oacute;n de cada eje sigue
       este orden x->y->z (rota primero x , luego y, y al final z).
      </para>
 </sect3>

 <sect3><title>Static/Over Time/Over Frames</title>

   <para> Esta opci&oacute;n permite la creaci&oacute;n de un video de un estudio
   din&aacute;mico. Seleccionando "over time" le permitir&iacute;a definir el tiempo
   de inicio y finalizaci&oacute;n dentro del volumen din&aacute;mico. Con la opci&oacute;n
   "over time", cada segundo es igual en terminos de cuantas im&aacute;genes
   de ese periodo de tiempo seran generadas para el video.</para>

   <para>Seleccionando "over frames" permite la la entrada de la
   primera y &uacute;ltima imagen (esto s&oacute;lo tiene sentido cuando se trata de
   un volumen &uacute;nico). La ventaja de la opci&oacute;n "over frames", es que
   cada marco de tiempo repercute por igual en el video final, asi
   cuando la din&aacute;mica de inter&eacute;s corresponden a la din&aacute;mica de la
   secuencia del marcos de tiempo del volumen, dando un resultado mas
   atractivo.  </para>

    <para> N&oacute;tese que cada vez que se atraviesa un marco de tiempo del
    volumen, el proceso de renderizado debe de cargar y prepara otro
    marco de tiempo. Esto hace que crear un video de renderizado
    din&aacute;mico es significativamente mas lento que crear un video solo
    con rotaciones.
    </para>
 </sect3>

</sect2>

  
  
