 <para> ROI(Region of Inter&eacute;st) es decir Regi&oacute;n de Inter&eacute;s. Un ROI
 designa un subvolumen del volumen de datos sobre el que ser&aacute;n
 calculadas las estad&iacute;sticas.
 </para>


<sect2><title>ROI Types</title>

  <para>
   Lo siguientes tipos de ROI son soportados por AMIDE:
  </para>
  
  <sect3><title>Geometric ROI's</title>

   <variablelist> 

    <varlistentry><term>Elipsoide</term>
    <listitem><para> Un elipsoide es similar a una esfera, pero con un
    radio que puede ser diferente en cada direcci&oacute;n [x,y,z]. Si x=y=z
    el elipsoide se convierte en una esfera. </para></listitem>
    </varlistentry>
  
    <varlistentry><term>Cilindro El&iacute;ptico</term>
    <listitem><para>Similar al cilindro excepto que su base en vez de
      un c&iacute;rculo es una elipse.  </para></listitem>
    </varlistentry>

    <varlistentry><term>Box</term>
    <listitem><para>Caja 3D.</para></listitem>
    </varlistentry>

   </variablelist>

  </sect3>
  
  <sect3><title>ROI Isocontorno</title>

    <para> ROI Isocontorno, son regiones seleccionadas del volumen
    cuyos l&iacute;mites tienen el mismo valor. Hay dos tipos, isocontronos
    2D y 3D .</para>
    
   <variablelist> 

    <varlistentry><term>Isocontorno 2D</term>

    <listitem><para>El isocontorno 2D se deriva del dibujado en uno de
      los cortes. . La profundidad del isocontorno 2D esta determinada
      por el grosor del corte visualizado. </para></listitem>
    </varlistentry>
  
    <varlistentry><term>Isocontorno 3D</term>
    <listitem><para>El isocontorno 3D se deriva considerando un valor
      del marco de tiempo selecionado del volumen
      activo. </para></listitem>
    </varlistentry>
  
   </variablelist>

 </sect3>
  
</sect2>


<sect2><title>Dibujando ROI's</title>

  <para>
    Para dibujar un ROI, primero necesita crear un ROI nuevo. Puede
    a&ntilde;adir un ROI a todo el estudio o a un volumen en particular. Para
    a&ntilde;adirlo al estudio, puede seleccionar el ROI en el menu item
    "Edit->add ROI:" , o hacer pulsar el bot&oacute;n 3 en el &aacute;rea desnuda el
    &aacute;rbol del estudio. Para a&ntilde;adir un ROI a un volumen , hacer
    SHIF+bot&oacute;n 3 sobre el volumen a a&ntilde;adir. En ambos casos emerger&aacute;
    una cajita de di&aacute;logo para entrar el nombre del ROI.
  </para>

  <para>
    Al a&ntilde;irlo al pricipio , el ROI nuevo (todav&iacute;a no dibujado) sera
    seleccionado en el &aacute;rbol del estudio. Cuando un ROI todavia no
    dibujado es seleccionado, el programa usara el la siguiente acci&oacute;n
    del rat&oacute;n sobre una vista para empezar el proceso de dibujo del
    ROI.  
  </para>

  <para>
    Para ROI's elipsoide, cilindroide y caja 3D, una pulsaci&oacute;n d el
    bot&oacute;n 1 empezar&aacute; un dibujo de borde a borde , mientras que si
    pulsamos el bot&oacute;n 3 empezar&aacute; el dibujo por el centro. Las
    dimensiones xy del ROI se determinan con este proceso. La
    dimensi&oacute;n z (grosor) del ROI se puede especificar en el di&aacute;logo
    que emerger&aacute; al acabar de dibujar el ROI.
   </para>

  <para>
   Para los isocontornos, el valor de donde este situado el cursor
   sera usado para derivar el isocontorno.
  </para>
    

</sect2>

<sect2><title>Manipulando ROI's</title>

  <para>
    Despu&eacute;s de haber dibujado un ROI, puede ser manipulado ajustando
    su volumen, posici&oacute;n y orientaci&oacute;n. Puede manipular directamente
    el ROI pulsando en cualquiera de las ventanas. El bot&oacute;n 1 se usa
    para desplazar los ROIs. El bot&oacute;n 2 para rotar los ROIs
    elpisoides, cilindroides y cajas 3D y en el caso de los ROI de
    isocontorno para borrar puntos. El bot&oacute;n 3 se usa para hacer zoom
    de los ROI's elipsoide, cylindro el&iacute;ptioco y caja 3D, y redefine
    le valor del isocontrono en el caso de esos ROIs.
  </para>

  <para>
    Tambi&eacute;n puede editar el tama&ntilde;o,situaci&oacute;n, orientaci&oacute;n, nombre
    etc.. pulsando el bot&oacute;n 3 sobre el nombre del ROI en la lista de
    items del estudio. Esto hace que aparezca el di&aacute;logo de
    Modificaci&oacute;n de ROIs (descrito en en <xref linkend="roi-dialog" />).
  </para>
    
</sect2>



<sect2 id="roi_statistics"><title>Calculando Estad&iacute;sticas</title>

  <para>
   Las estad&iacute;sticas dentro de un ROI se pueden calcular con el menu
   item "Tools->calulate ROI statistics" . Eligiendo este emerger&aacute; un
   di&aacute;logo que le permitir&aacute; elegir entre que ROI (o todos) y entre que
   vol&uacute;menes (o todos) quiere que se calculen las
   estad&iacute;sticas. Tambi&eacute;n pude elegir que se calcule sobre subconjuntos
   de v&oacute;xeles, significando el c&aacute;lculo sobre el x% de v&oacute;xeles con
   valor m&aacute;ximo del ROI.  
  </para>

  <para>
    Despues de pulse 'execute' , ejecutar, tras unos instantes el
    programa mostrar&aacute; los valores calculados. Seleccionando "save as"
    permite guardarlo es un fichero con los valores separados por una
    tab (TSV). Este fichero deber&iacute;a ser importado f&aacute;cilmente a
    cualquier hoja de c&aacute;lculo (Excel es un poco est&uacute;pido, tiene que
    expecificarle que esta importando un fichero TSV, Tab Separated
    Values).
  </para>

  



 <sect3><title>Facilidades para los C&aacute;lculos de los ROI</title>
  
  <sect4><title>Varianza/Std. Dev./Std. Err.</title>
    
    <para>
     A d&iacute;a de hoy, AMIDE genera valores de
     varianza/std. dev./std. error que ocasionalmente pueden interesar
     para los investigadores. Es muy importante recordar , que esos
     n&uacute;meros representan el ruido en los datos, NO el ruido en su
     experiemento.
    </para>

    <para> La varianza del experimento solo puede ser tomada
      repitiendo multiples muestras (p.e. haciendo multiples scans) y
      calculando la varianza entre diferentes muestras.
    </para>

  </sect4>

  <sect4 id="roi-volume-calculation"><title>Cambiando el Volumen Calculado</title> 

   <para><emphasis>Historia corta:</emphasis> El volumen calculado
     mostrado por el di&aacute;logo de estad&iacute;sticas del ROI es correcto. Use
     este valor como volumen del ROI, no el que podr&iacute;a calcular a man
     bas&aacute;ndose en las dimensi&oacute;nes del ROI.
   </para>

   <para><emphasis>Historia larga:</emphasis> AMIDE calcula el ROI's
     trasladando las dimensi&oacute;nes del ROI al las coordenadas del
     espacio del volumen de datos. Entonces calcula las estad&iacute;sticas
     de todos los vol&uacute;menes de datos que hay en el ROI. Para los
     v&oacute;xeles que caen en el l&iacute;mite del ROI, AMIDE subdividir&aacute; el voxel
     en un n&uacute;mero finito de subv&oacute;xeles, y hace el c&aacute;lculo sobre los
     subv&oacute;xeles. Esta aproximaci&oacute;n resulta en estad&iacute;sticas correctas,
     pero es importante darse cuenta que el ROI calculado es una
     representaci&oacute;n discretizada del ROI anal&iacute;tico. As&iacute; que mientras
     el verdadero volumen de un elipsoide es pi*r1*r2*r3, el volumen
     calculado por AMIDE depender&aacute; del n&uacute;mero de v&oacute;xeles y subv&oacute;xeles
     que se determinan dentro del elipsoide, que a su vez puede
     depender de la orientaci&oacute;n del ROI respecto al volumen de datos
     en cuesti&oacute;n. Como el volumen dado por AMIDE representa el
     subvolumen en el volumen de datos para el c&aacute;lculo del ROI, querr&aacute;
     usar ese valor (no el valor real elipsoide).
    </para>
  </sect4>

 </sect3>

 <sect3 id="roi-terms"><title>Explicaciones de los Valores Estad&iacute;sticos de los ROI's</title>

  <variablelist>
  
   <varlistentry><term>Total</term> <listitem><para>La suma de los
   valores de todos los v&oacute;xeles en el ROI. Los V&oacute;xeles que estan
   parcialmente encerrados por el ROI son proporcionalmente
   sopesados.</para></listitem>
   </varlistentry>

   <varlistentry><term>Mediana</term> <listitem><para>Es el valor de
   mediana value de todos los v&oacute;xeles que estan total o parcialmente
   incluidos en el ROI. Para un numero par de v&oacute;xeles , la mediana se
   define como el promedio de los 2 valores
   centrales. </para></listitem>
   </varlistentry>

   <varlistentry><term>Media</term> <listitem><para>El valor media de
   los v&oacute;xeles del ROI. Los v&oacute;xeles parcialmente incluidos en el ROI
   son proporcionalmente sopesados. </para></listitem>
   </varlistentry>

   <varlistentry><term>Varianza</term> <listitem><para>La varianza de
   los v&oacute;xeles en el ROI. Esta es de hecho un c&aacute;lculo de varianza
   sopesada asi los v&oacute;xeles parcialmente inclu&iacute;dos en el ROI son
   correctamente manejados. </para></listitem>
   </varlistentry>

   <varlistentry><term>Desviaci&oacute;n Estandard</term>
   <listitem><para>La raiz cuadrada de la varianza.</para></listitem>
   </varlistentry>

   <varlistentry><term>Error Estandard</term> <listitem><para>La raiz
   cuadrada de la varianza , dividido por la raiz cuadrada del numero
   total de v&oacute;xeles (total o parcialmente) en el
   ROI.</para></listitem>
   </varlistentry>

   <varlistentry><term>M&iacute;nimo/M&aacute;ximo</term> <listitem><para>El valor
   m&iacute;nimo y m&aacute;ximo de todos los v&oacute;xeles parcial o totalmente incluidos
   en el ROI. </para></listitem>
   </varlistentry>

   <varlistentry><term>Tama&ntilde;o</term> <listitem><para>El volumen de un
   ROI (en mm c&uacute;bicos). Detalles de este c&aacute;lculo arriba en: <xref
   linkend="roi-volume-calculation" />.</para></listitem>
   </varlistentry>

   <varlistentry><term>Fractional Voxels</term> <listitem><para>Es la
   suma del peso de los v&oacute;xeles, y da una indicaci&oacute;n de cuan grande es
   el ROI en el espacio de v&oacute;xeles.</para></listitem>
   </varlistentry>

   <varlistentry><term>V&oacute;xeles</term>
   <listitem><para>Es el n&uacute;mero total de v&oacute;xeles incluidos calculando
     el ROI, tanto parcial como totalmente. En contraste a la medida
     "Fraction Voxels", los "V&oacute;xeles" dan mejor indicaci&oacute;n de la
     valided estad&iacute;stica de la median, varianza, etc ..
   </para></listitem>
   </varlistentry>

  </variablelist>
 </sect3>

</sect2>



<sect2 id="roi-dialog"><title>Di&aacute;logo de Modificaci&oacute;n de ROI</title>

 <para>
   Para modificar directamente los par&aacute;metros del ROI, pulsar el bot&oacute;n
   3 en el nombre del ROI en el &aacute;rbol del estudio, para que emerga el
   di&aacute;logo de modificaci&oacute;n. Los par&aacute;metros que se pueden modificar se
   dividen en dos p&aacute;ginas.  pages.
 </para>

 <variablelist>
  <varlistentry><term>Informaci&oacute;n B&aacute;sica</term>
   <listitem><para>
    El nombre y tipo de ROI se puede alterar en esta p&aacute;gina. 
   </para></listitem>
  </varlistentry>
    
  <varlistentry><term>Centro</term>
   <listitem><para>
    El centro del ROI puede despalzarse en esta p&aacute;gina . Los par&aacute;metros xyz estan en mil&iacute;metros. 
   </para></listitem>
  </varlistentry>
    
  <varlistentry><term>Dimensiones</term>
   <listitem><para>
     El tama&ntilde;o del ROI se puede alterar en esta p&aacute;gina. Las
     dimensi&oacute;nes x, y, y z estan mil&iacute;metros y orientadas con respecto
     a la orientaci&oacute;n del ROI.  </para></listitem>
  </varlistentry>
    
  <varlistentry><term>Rotar</term>
   <listitem><para>
     El ROI puede rotarse sobre su centro en esta p&aacute;gina . Hay una
     ruedecilla para cada uno de los tres planos. La ruedecilla
    transversal rotar&aacute; el ROIen el plano transverso (rota sobre el eje
    z). La rudecilla coronal rotar&aacute; el ROI en el plano coronal (rota
    sobre el eje y). Y la ruedecilla sagital girar&aacute; el ROI en el plano
    sagital (rota sobre el eje x). El bot&oacute;n "reset to default" deshace
    los giros dejando la orientaci&oacute;n original. Al pie de esta p&aacute;gina
    hay una matriz que muestra las coordinadas del ROI respecto a las
    coordenadas de origen.  </para></listitem>
  </varlistentry>
  </variablelist>
</sect2>







